zephyrproject-rtos/hal_nxp/dts/nxp/lpc/lpc51u68/pinctrl/LPC51U68JBD64-pinctrl.h
#define DMA0_TRIG14_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define DMA0_TRIG14_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define DMA0_TRIG15_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define DMA0_TRIG16_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define DMA0_TRIG17_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define DMA0_TRIG18_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define DMA0_TRIG19_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define DMA0_TRIG1_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define DMA0_TRIG2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
