zephyrproject-rtos/hal_nxp/dts/nxp/lpc/lpc51u68/pinctrl/LPC51U68JBD64-pinctrl.h
#define DMA0_TRIG3_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define DMA0_TRIG3_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define DMA0_TRIG4_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define DMA0_TRIG5_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define DMA0_TRIG6_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define DMA0_TRIG7_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define DMA0_TRIG8_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define DMA0_TRIG9_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define FC0_CTS_SDA_SSEL0_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 1)
#define FC0_RTS_SCL_SSEL1_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 1)
#define FC0_RXD_SDA_MOSI_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 1)
#define FC0_RXD_SDA_MOSI_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 2)
#define FC0_SCK_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 2)
#define FC0_SCK_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 1)
#define FC0_TXD_SCL_MISO_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 1)
#define FC0_TXD_SCL_MISO_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 2)
#define FC1_CTS_SDA_SSEL0_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 1)
#define FC1_RTS_SCL_SSEL1_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 1)
#define FC1_RXD_SDA_MOSI_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 1)
#define FC1_SCK_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 5)
#define FC1_SCK_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 4)
#define FC1_TXD_SCL_MISO_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 1)
#define FC2_CTS_SDA_SSEL0_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 2)
#define FC2_RTS_SCL_SSEL1_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 2)
#define FC2_RXD_SDA_MOSI_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 1)
#define FC2_RXD_SDA_MOSI_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 2)
#define FC2_SCK_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 1)
#define FC2_SSEL2_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 2)
#define FC2_SSEL3_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 2)
#define FC2_TXD_SCL_MISO_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 1)
#define FC3_CTS_SDA_SSEL0_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 2)
#define FC3_CTS_SDA_SSEL0_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 1)
#define FC3_CTS_SDA_SSEL0_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 5)
#define FC3_RTS_SCL_SSEL1_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 2)
#define FC3_RTS_SCL_SSEL1_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 1)
#define FC3_RXD_SDA_MOSI_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 1)
#define FC3_RXD_SDA_MOSI_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 2)
#define FC3_SCK_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 1)
#define FC3_SCK_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 5)
#define FC3_SSEL2_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 1)
#define FC3_SSEL2_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 2)
#define FC3_SSEL3_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 1)
#define FC3_TXD_SCL_MISO_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 1)
#define FC3_TXD_SCL_MISO_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 5)
#define FC4_CTS_SDA_SSEL0_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 1)
#define FC4_RTS_SCL_SSEL1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 1)
#define FC4_RXD_SDA_MOSI_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 5)
#define FC4_SCK_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 5)
#define FC4_SCK_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 4)
#define FC4_TXD_SCL_MISO_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 5)
#define FC5_RXD_SDA_MOSI_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 1)
#define FC5_RXD_SDA_MOSI_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 2)
#define FC5_SCK_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 1)
#define FC5_SSEL2_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 4)
#define FC5_SSEL3_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 4)
#define FC5_TXD_SCL_MISO_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 1)
#define FC5_TXD_SCL_MISO_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 2)
#define FC6_CTS_SDA_SSEL0_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 2)
#define FC6_CTS_SDA_SSEL0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 2)
#define FC6_RTS_SCL_SSEL1_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 2)
#define FC6_RTS_SCL_SSEL1_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 2)
#define FC6_RXD_SDA_MOSI_DATA_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 2)
#define FC6_RXD_SDA_MOSI_DATA_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 1)
#define FC6_SCK_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 1)
#define FC6_TXD_SCL_MISO_WS_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 2)
#define FC6_TXD_SCL_MISO_WS_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 1)
#define FC6_TXD_SCL_MISO_WS_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 2)
#define FC7_CTS_SDA_SSEL0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 4)
#define FC7_CTS_SDA_SSEL0_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 2)
#define FC7_RTS_SCL_SSEL1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 4)
#define FC7_RTS_SCL_SSEL1_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 2)
#define FC7_RXD_SDA_MOSI_DATA_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 4)
#define FC7_RXD_SDA_MOSI_DATA_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 2)
#define FC7_SCK_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 4)
#define FC7_SCK_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 2)
#define FC7_SSEL2_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 2)
#define FC7_SSEL3_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 2)
#define FC7_TXD_SCL_MISO_WS_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 4)
#define FC7_TXD_SCL_MISO_WS_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 2)
#define GPIO_PIO00_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define GPIO_PIO010_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define GPIO_PIO011_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define GPIO_PIO012_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define GPIO_PIO013_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define GPIO_PIO014_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define GPIO_PIO015_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define GPIO_PIO016_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define GPIO_PIO017_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define GPIO_PIO018_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define GPIO_PIO019_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define GPIO_PIO01_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define GPIO_PIO020_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define GPIO_PIO021_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define GPIO_PIO022_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define GPIO_PIO023_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define GPIO_PIO024_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define GPIO_PIO025_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define GPIO_PIO026_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define GPIO_PIO029_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define GPIO_PIO02_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define GPIO_PIO030_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define GPIO_PIO031_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define GPIO_PIO03_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define GPIO_PIO04_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define GPIO_PIO05_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define GPIO_PIO06_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define GPIO_PIO07_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define GPIO_PIO08_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define GPIO_PIO09_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define GPIO_PIO10_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define GPIO_PIO110_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define GPIO_PIO111_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define GPIO_PIO112_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define GPIO_PIO113_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define GPIO_PIO114_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define GPIO_PIO115_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define GPIO_PIO116_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define GPIO_PIO117_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define GPIO_PIO11_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define GPIO_PIO12_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
