zephyrproject-rtos/hal_nxp/dts/nxp/lpc/lpc51u68/pinctrl/LPC51U68JBD64-pinctrl.h
#define GPIO_PIO13_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define GPIO_PIO14_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define GPIO_PIO15_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define GPIO_PIO16_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define GPIO_PIO17_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define GPIO_PIO18_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define GPIO_PIO19_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define IOCON_MUX(offset, type, mux)		 (((offset & 0xFFF) << 20) |		 (((type) & 0x3) << 18) |		 (((mux) & 0xF) << 0))
#define IOCON_TYPE_A 0x2
#define IOCON_TYPE_D 0x0
#define IOCON_TYPE_I 0x1
#define MCLK_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 4)
#define MCLK_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 1)
#define PINT_PINT0_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define PINT_PINT0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define PINT_PINT1_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define PINT_PINT2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_2 IOCON_MUX(2, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_3 IOCON_MUX(3, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0)
#define PINT_PINT3_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0)
#define SCT0_OUT0_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 2)
#define SCT0_OUT0_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 2)
#define SCT0_OUT1_PIO0_1 IOCON_MUX(1, IOCON_TYPE_D, 5)
#define SCT0_OUT1_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 2)
#define SCT0_OUT1_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 2)
#define SCT0_OUT2_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 2)
#define SCT0_OUT2_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 2)
#define SCT0_OUT3_PIO0_0 IOCON_MUX(0, IOCON_TYPE_D, 5)
#define SCT0_OUT3_PIO0_10 IOCON_MUX(10, IOCON_TYPE_D, 2)
#define SCT0_OUT3_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 2)
#define SCT0_OUT4_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 2)
#define SCT0_OUT4_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 3)
#define SCT0_OUT4_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 3)
#define SCT0_OUT5_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 2)
#define SCT0_OUT5_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 2)
#define SCT0_OUT5_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 3)
#define SCT0_OUT6_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 2)
#define SCT0_OUT6_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 3)
#define SCT0_OUT7_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 3)
#define SCT0_OUT7_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 3)
#define SWCLK_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 5)
#define SWDIO_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 5)
#define USB0_FRAME_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 7)
#define USB0_FRAME_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 7)
#define USB0_UP_LED_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 7)
#define USB0_UP_LED_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 6)
#define USB0_VBUS_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 7)
#define USB0_VBUS_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 7)
#define UTICK0_CAPTURE0_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 5)
#define UTICK0_CAPTURE1_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 5)
#define UTICK0_CAPTURE2_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 5)
#define UTICK0_CAPTURE3_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 5)

#endif /* _ZEPHYR_DTS_BINDING_LPC51U68JBD64_ */
